Repository: pypi-data/pypi-mirror-392
Catalog: packages/mds-cashbook/mds_cashbook-7.0.41-py3-none-any.whl/trytond/modules/cashbook/locale/*.po
Languages: de

# field:cashbook.line,reconciliation:
source: Reconciliation
de: Abstimmung

# field:cashbook.line,party:
source: Party
de: Partei

# field:cashbook.line,booktransf:
source: Source/Dest
de: Quelle/Ziel

# field:cashbook.line,owner_cashbook:
source: Owner
de: Eigentümer

# field:cashbook.line,reference:
source: Reference
de: Referenz

# help:cashbook.line,reference:
source: The current row was created by and is controlled by the reference row.
de: Die aktuelle Zeile wurde durch die Referenzzeile erstellt und wird von dieser gesteuert.

# field:cashbook.line,references:
source: References
de: Referenzen

# help:cashbook.line,references:
source: The rows are created and managed by the current record.
de: Die Zeilen werden durch den aktuellen Datensatz erstellt und verwaltet.

# field:cashbook.line,payee:
source: Payee
de: Empfänger

# selection:cashbook.line,payee:
source: Cashbook
de: Kassenbuch

# selection:cashbook.line,payee:
source: Party
de: Partei

# field:cashbook.line,number:
source: Number
de: Nummer

# field:cashbook.line,splitlines:
source: Split booking lines
de: Splitbuchungszeilen

# help:cashbook.line,splitlines:
source: Rows with different categories form the total sum of the booking
de: Zeilen mit unterschiedlichen Kategorien bilden die Gesamtsumme der Buchung

# field:cashbook.line,currency2nd:
source: 2nd Currency
de: Fremdwährung

# field:cashbook.line,currency2nd_digits:
source: 2nd Currency Digits
de: Nachkommastellen Fremdwährung

# field:cashbook.line,amount_2nd_currency:
source: Amount Second Currency
de: Fremdwährungsbetrag

# field:cashbook.line,rate_2nd_currency:
source: Rate
de: Kurs

# help:cashbook.line,rate_2nd_currency:
source: Exchange rate between the currencies of the participating cashbooks.
de: Wechselkurs zwischen der Währungen der beteiligten Kassenbücher.

# field:cashbook.line,feature:
source: Feature
de: Merkmal

# field:cashbook.line,booktransf_feature:
source: Feature
de: Merkmal

# model:cashbook.type,name:
source: Cashbook Type
de: Kassenbuchtyp

# field:cashbook.type,short:
source: Abbreviation
de: Kürzel

# field:cashbook.type,company:
source: Company
de: Unternehmen

# field:cashbook.type,feature:
source: Feature
de: Merkmal

# help:cashbook.type,feature:
source: Select feature set of the Cashbook.
de: Wählen Sie den Funktionsumfang des Kassenbuchs aus.

# model:cashbook.category,name:
source: Category
de: Kategorie

# view:cashbook.category:
source: General Information
de: Allgemeine Informationen

# view:cashbook.category:
source: Children
de: Untergeordnet

# field:cashbook.category,description:
source: Description
de: Beschreibung

# field:cashbook.category,company:
source: Company
de: Unternehmen

# field:cashbook.category,parent:
source: Parent
de: Übergeordnet

# field:cashbook.category,childs:
source: Children
de: Untergeordnet

# field:cashbook.category,cattype:
source: Type
de: Typ

# help:cashbook.category,cattype:
source: Type of Category
de: Typ der Kategorie

# selection:cashbook.category,cattype:
source: Revenue
de: Einnahme

# selection:cashbook.category,cattype:
source: Expense
de: Ausgabe

# model:cashbook.open_lines.start,name:
source: Open Cashbook
de: Kassenbuch öffnen

# field:cashbook.open_lines.start,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.open_lines.start,checked:
source: Checked
de: Geprüft

# help:cashbook.open_lines.start,checked:
source: Show cashbook lines in Checked-state.
de: Zeigt Kassenbuchzeilen im 'Geprüft'-Status

# field:cashbook.open_lines.start,done:
source: Done
de: Fertig

# help:cashbook.open_lines.start,done:
source: Show cashbook lines in Done-state.
de: Zeigt Kassenbuchzeilen im 'Fertig'-Status

# field:cashbook.open_lines.start,date_from:
source: Start Date
de: Beginndatum

# field:cashbook.open_lines.start,date_to:
source: End Date
de: Endedatum

# field:cashbook.open_lines.start,num_books:
source: Number of Cashbooks
de: Anzahl Kassenbücher

# model:cashbook.open_lines,name:
source: Open Cashbook
de: Kassenbuch öffnen

# model:cashbook.open_lines_tree,name:
source: Open Cashbook
de: Kassenbuch öffnen

# wizard_button:cashbook.open_lines,askuser,end:
source: Cancel
de: Abbruch

# wizard_button:cashbook.open_lines,askuser,open_:
source: Open
de: Öffnen

# model:cashbook.line.context,name:
source: Line Context
de: Zeilenkontext

# field:cashbook.line.context,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.line.context,checked:
source: Checked
de: Geprüft

# help:cashbook.line.context,checked:
source: Show cashbook lines in Checked-state.
de: Zeigt Kassenbuchzeilen im 'Geprüft'-Status

# field:cashbook.line.context,done:
source: Done
de: Fertig

# help:cashbook.line.context,done:
source: Show cashbook lines in Done-state.
de: Zeigt Kassenbuchzeilen im 'Fertig'-Status

# field:cashbook.line.context,date_from:
source: Start Date
de: Beginndatum

# help:cashbook.line.context,date_from:
source: Limits the date range for the displayed entries.
de: Begrenzt den Datumsbereich für die angezeigten Einträge.

# field:cashbook.line.context,date_to:
source: End Date
de: Endedatum

# help:cashbook.line.context,date_to:
source: Limits the date range for the displayed entries.
de: Begrenzt den Datumsbereich für die angezeigten Einträge.

# model:cashbook.configuration,name:
source: Configuration
de: Konfiguration

# view:cashbook.configuration:
source: Enter Booking Wizard
de: Dialog: Buchung eingeben

# view:cashbook.configuration:
source: Open Cashbook Wizard
de: Dialog: Kassenbuch öffnen

# view:cashbook.configuration:
source: Cashbook
de: Kassenbuch

# field:cashbook.configuration,defbook:
source: Default Cashbook
de: Standardkassenbuch

# help:cashbook.configuration,defbook:
source: The default cashbook is selected when you open the booking wizard.
de: Das Standardkassenbuch wird beim Öffnen des Buchungswizards ausgewählt.

# field:cashbook.configuration,book1:
source: Cashbook 1
de: Kassenbuch 1

# help:cashbook.configuration,book1:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration,book2:
source: Cashbook 2
de: Kassenbuch 2

# help:cashbook.configuration,book2:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration,book3:
source: Cashbook 3
de: Kassenbuch 3

# help:cashbook.configuration,book3:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration,book4:
source: Cashbook 4
de: Kassenbuch 4

# help:cashbook.configuration,book4:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration,book5:
source: Cashbook 5
de: Kassenbuch 5

# help:cashbook.configuration,book5:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration,fixate:
source: Check booking
de: Buchung prüfen

# help:cashbook.configuration,fixate:
source: Check of the booking is activated.
de: Das Prüfen der Buchung ist aktiviert.

# field:cashbook.configuration,date_from:
source: Start Date
de: Beginndatum

# field:cashbook.configuration,date_to:
source: End Date
de: Endedatum

# field:cashbook.configuration,checked:
source: Checked
de: Geprüft

# help:cashbook.configuration,checked:
source: Show cashbook lines in Checked-state.
de: Zeigt Kassenbuchzeilen im 'Geprüft'-Status

# field:cashbook.configuration,done:
source: Done
de: Fertig

# help:cashbook.configuration,done:
source: Show cashbook lines in Done-state.
de: Zeigt Kassenbuchzeilen im 'Fertig'-Status

# field:cashbook.configuration,catnamelong:
source: Category: Show long name
de: Kategorie: langen Namen zeigen

# help:cashbook.configuration,catnamelong:
source: Shows the long name of the category in the Category field of a cash book line.
de: Zeigt im Feld 'Kategorie' einer Kassenbuchzeile den langen Namen der Kategorie.

# model:cashbook.configuration_user,name:
source: User Configuration
de: Nutzer Konfiguration

# field:cashbook.configuration_user,date_from:
source: Start Date
de: Beginndatum

# field:cashbook.configuration_user,date_to:
source: End Date
de: Endedatum

# field:cashbook.configuration_user,checked:
source: Checked
de: Geprüft

# help:cashbook.configuration_user,checked:
source: Show cashbook lines in Checked-state.
de: Zeigt Kassenbuchzeilen im 'Geprüft'-Status

# field:cashbook.configuration_user,done:
source: Done
de: Fertig

# help:cashbook.configuration_user,done:
source: Show cashbook lines in Done-state.
de: Zeigt Kassenbuchzeilen im 'Fertig'-Status

# field:cashbook.configuration_user,catnamelong:
source: Category: Show long name
de: Kategorie: langen Namen zeigen

# help:cashbook.configuration_user,catnamelong:
source: Shows the long name of the category in the Category field of a cash book line.
de: Zeigt im Feld 'Kategorie' einer Kassenbuchzeile den langen Namen der Kategorie.

# field:cashbook.configuration_user,defbook:
source: Default Cashbook
de: Standardkassenbuch

# help:cashbook.configuration_user,defbook:
source: The default cashbook is selected when you open the booking wizard.
de: Das Standardkassenbuch wird beim Öffnen des Buchungswizards ausgewählt.

# field:cashbook.configuration_user,book1:
source: Cashbook 1
de: Kassenbuch 1

# help:cashbook.configuration_user,book1:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration_user,book2:
source: Cashbook 2
de: Kassenbuch 2

# help:cashbook.configuration_user,book2:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration_user,book3:
source: Cashbook 3
de: Kassenbuch 3

# help:cashbook.configuration_user,book3:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration_user,book4:
source: Cashbook 4
de: Kassenbuch 4

# help:cashbook.configuration_user,book4:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration_user,book5:
source: Cashbook 5
de: Kassenbuch 5

# help:cashbook.configuration_user,book5:
source: Cash book available in selection dialog.
de: in Auswahldialog verfügbares Kassenbuch.

# field:cashbook.configuration_user,fixate:
source: Fixate
de: Festschreiben

# help:cashbook.configuration_user,fixate:
source: Fixating of the booking is activated.
de: Die Festschreiben der Buchung ist aktiviert.

# model:cashbook.recon,name:
source: Cashbook Reconciliation
de: Kassenbuchabstimmung

# view:cashbook.recon:
source: Reconciliation period
de: Abstimmungszeitraum

# view:cashbook.recon:
source: State
de: Status

# field:cashbook.recon,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.recon,date:
source: Date
de: Datum

# field:cashbook.recon,date_from:
source: Start Date
de: Anfangsdatum

# field:cashbook.recon,date_to:
source: End Date
de: Endedatum

# field:cashbook.recon,state:
source: State
de: Status

# selection:cashbook.recon,state:
source: Edit
de: Bearbeiten

# selection:cashbook.recon,state:
source: Check
de: Prüfen

# selection:cashbook.recon,state:
source: Done
de: Fertig

# field:cashbook.recon,lines:
source: Lines
de: Zeilen

# field:cashbook.recon,state_cashbook:
source: State of Cashbook
de: Kassenbuchstatus

# selection:cashbook.recon,state_cashbook:
source: Open
de: Geöffnet

# selection:cashbook.recon,state_cashbook:
source: Closed
de: Geschlossen

# selection:cashbook.recon,state_cashbook:
source: Archive
de: Archiv

# field:cashbook.recon,start_amount:
source: Start Amount
de: Anfangsbetrag

# field:cashbook.recon,end_amount:
source: End Amount
de: Endbetrag

# field:cashbook.recon,predecessor:
source: Predecessor
de: Vorgänger

# field:cashbook.recon,feature:
source: Feature
de: Merkmal

# model:cashbook.runrepbook.start,name:
source: Cashbook Report
de: Kassenbuch Bericht

# view:cashbook.runrepbook.start:
source: Here you can export a cashbook in tabular form for printing.
de: Sie können hier ein Kassenbuch in Tabellenform zum Drucken exportieren.

# view:cashbook.runrepbook.start:
source: The time range for the export is determined by the created reconciliation.
de: Der zeitliche Bereich für den Export wird durch die erstellte Abstimmung festgelegt.

# view:cashbook.runrepbook.start:
source: If you have not already done so, first create a reconciliation for the cashbook.
de: Wenn noch nicht erfolgt, erstellen Sie zunächst eine Abstimmung für das Kassenbuch.

# field:cashbook.runrepbook.start,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.runrepbook.start,cashbooks:
source: Cashbooks
de: Kassenbücher

# field:cashbook.runrepbook.start,reconciliation:
source: Reconciliation
de: Abstimmung

# field:cashbook.runrepbook.start,reconciliations:
source: Reconciliations
de: Abstimmungen

# report:cashbook.reprecon:
source: Cashbook:
de: Kassenbuch:

# report:cashbook.reprecon:
source: Period:
de: Zeitraum:

# report:cashbook.reprecon:
source: to
de: bis

# report:cashbook.reprecon:
source: Bookings:
de: Buchungen:

# report:cashbook.reprecon:
source: Initial Amount
de: Anfangsbetrag

# report:cashbook.reprecon:
source: End Amount
de: Endbetrag

# report:cashbook.reprecon:
source: Date
de: Datum

# report:cashbook.reprecon:
source: No.
de: Nr

# report:cashbook.reprecon:
source: Description
de: Beschreibung

# report:cashbook.reprecon:
source: Revenue
de: Einnahme

# report:cashbook.reprecon:
source: Expense
de: Ausgabe

# report:cashbook.reprecon:
source: Sum
de: Summe

# report:cashbook.reprecon:
source: - Expenses
de: - Ausgaben

# report:cashbook.reprecon:
source: Total
de: Gesamt

# report:cashbook.reprecon:
source: Payee
de: Empfänger

# model:cashbook.enterbooking.start,name:
source: Enter Booking
de: Buchung eingeben

# view:cashbook.enterbooking.start:
source: Description
de: Beschreibung

# view:cashbook.enterbooking.start:
source: Booking
de: Buchung

# field:cashbook.enterbooking.start,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.enterbooking.start,cashbooks:
source: Cashbooks
de: Kassenbücher

# field:cashbook.enterbooking.start,currency_digits:
source: Currency Digits
de: Nachkommastellen Währung

# field:cashbook.enterbooking.start,currency:
source: Currency
de: Währung

# field:cashbook.enterbooking.start,bookingtype:
source: Type
de: Typ

# selection:cashbook.enterbooking.start,bookingtype:
source: Revenue
de: Einnahme

# selection:cashbook.enterbooking.start,bookingtype:
source: Revenue Splitbooking
de: Einnahme Splitbuchung

# selection:cashbook.enterbooking.start,bookingtype:
source: Expense
de: Ausgabe

# selection:cashbook.enterbooking.start,bookingtype:
source: Expense Splitbooking
de: Ausgabe Splitbuchung

# selection:cashbook.enterbooking.start,bookingtype:
source: Transfer from
de: Umbuchung von

# selection:cashbook.enterbooking.start,bookingtype:
source: Transfer to
de: Umbuchung nach

# field:cashbook.enterbooking.start,amount:
source: Amount
de: Betrag

# field:cashbook.enterbooking.start,owner_cashbook:
source: Owner
de: Eigentümer

# field:cashbook.enterbooking.start,category:
source: Category
de: Kategorie

# field:cashbook.enterbooking.start,booktransf:
source: Source/Dest
de: Quelle/Ziel

# field:cashbook.enterbooking.start,party:
source: Party
de: Partei

# field:cashbook.enterbooking.start,description:
source: Description
de: Beschreibung

# field:cashbook.enterbooking.start,fixate:
source: Check booking
de: Buchung prüfen

# help:cashbook.enterbooking.start,fixate:
source: The booking is checked immediately.
de: Die Buchung wird sofort geprüft.

# field:cashbook.enterbooking.start,date:
source: Date
de: Datum

# help:cashbook.enterbooking.start,date:
source: Date of booking
de: Datum der Buchung

# model:cashbook.enterbooking,name:
source: Enter Booking
de: Buchung eingeben

# wizard_button:cashbook.enterbooking,start,end:
source: Cancel
de: Abbruch

# wizard_button:cashbook.enterbooking,start,save_:
source: Save
de: Speichern

# wizard_button:cashbook.enterbooking,start,savenext_:
source: Save & Next
de: Speichern & Weiter

# model:cashbook.values,name:
source: Value Store
de: Wertespeicher

# field:cashbook.values,resource:
source: Resource
de: Ressource

# field:cashbook.values,field_name:
source: Field Name
de: Feldname

# field:cashbook.values,numvalue:
source: Value
de: Wert

# field:cashbook.values,valuedigits:
source: Digits
de: Dezimalstellen
