Repository: pypi-data/pypi-mirror-392
Catalog: packages/mds-cashbook/mds_cashbook-7.0.41-py3-none-any.whl/trytond/modules/cashbook/locale/*.po
Languages: de

# selection:ir.cron,method:
source: Update Cashbooks
de: Kassenbücher Aktualisieren

# model:ir.message,text:msg_type_short_unique
source: The Abbreviation must be unique.
de: Das Kürzel muß eindeutig sein.

# model:ir.message,text:msg_name_cashbook
source: Cashbook
de: Kassenbuch

# model:ir.message,text:msg_name_reconciliation
source: Reconciliation
de: Abstimmung

# model:ir.message,text:msg_line_wrong_state_value
source: Invalid value of the field 'Status', allowed: edit, check, done.
de: Ungültiger Wert des Feldes 'Status', erlaubt: edit, check, done.

# model:ir.message,text:msg_book_wrong_state_value
source: Invalid value of the field 'Status', allowed: open, closed, archive.
de: Ungültiger Wert des Feldes 'Status', erlaubt: open, closed, archive.

# model:ir.message,text:msg_book_deny_delete
source: The cashbook '%(bookname)s' cannot be deleted because it contains %(booklines)s lines and is not in the status 'Archive'.
de: Das Kassenbuch '%(bookname)s' kann nicht gelöscht werden, da es %(booklines)s Zeilen enthält und nicht im Status 'Archiv' ist.

# model:ir.message,text:msg_book_deny_write
source: The cashbook '%(bookname)s' is '%(state_txt)s' and cannot be changed.
de: Das Kassenbuch '%(bookname)s' ist '%(state_txt)s' und kann nicht geändert werden.

# model:ir.message,text:msg_line_deny_delete1
source: The cashbook line '%(linetxt)s' cannot be deleted because the Cashbook '%(bookname)s' is in state '%(bookstate)s'.
de: Die Kassenbuchzeile '%(linetxt)s' kann nicht gelöscht werden, weil das Kassenbuch '%(bookname)s' im Status '%(bookstate)s' ist.

# model:ir.message,text:msg_line_deny_delete2
source: The cashbook line '%(linetxt)s' cannot be deleted, its in state '%(linestate)s'.
de: Die Kassenbuchzeile '%(linetxt)s' kann nicht gelöscht werden, da sie im Status '%(linestate)s' ist.

# model:ir.message,text:msg_line_deny_stateedit_with_recon
source: The status cannot be changed to 'Edit' while the line '%(recname)s' is associated with a reconciliation.
de: Der Status kann nicht in 'Bearbeiten' geändert werden, während die Zeile '%(recname)s' mit einer Abstimmung verbunden ist.

# model:ir.message,text:msg_line_deny_write
source: The cashbook line '%(recname)s' is '%(state_txt)s' and cannot be changed.
de: Die Kassenbuchzeile '%(recname)s' ist '%(state_txt)s' und kann nicht geändert werden.

# model:ir.message,text:msg_recon_deny_delete1
source: The reconciliation '%(recontxt)s' cannot be deleted because the Cashbook '%(bookname)s' is in state '%(bookstate)s'.
de: Die Abstimmung '%(recontxt)s' kann nicht gelöscht werden, weil das Kassenbuch '%(bookname)s' im Status '%(bookstate)s' ist.

# model:ir.message,text:msg_recon_deny_delete2
source: The reconciliation '%(recontxt)s' cannot be deleted, its in state '%(reconstate)s'.
de: Die Abstimmung '%(recontxt)s' kann nicht gelöscht werden, da sie im Status '%(reconstate)s' ist.

# model:ir.message,text:msg_setting_already_exists
source: Settings for this user alredy exists.
de: Einstellungen für diesen Benutzer sind bereits vorhanden.

# model:ir.message,text:msg_category_name_unique
source: The category name already exists at this level.
de: Der Kategoriename existiert auf dieser Ebene bereits.

# model:ir.message,text:msg_category_type_not_like_parent
source: The type of the current category '%(catname)s' must be equal to the type of the parent category '%(parentname)s'.
de: Der Typ der aktuellen Kategorie '%(catname)s' muß gleich dem Typ der übergeordneten Kategorie '%(parentname)s' sein.

# model:ir.message,text:msg_line_deny_recon_by_state
source: For reconciliation, the line '%(recname)s' must be in the status 'Check' or 'Done'.
de: Für die Abstimmung muss die Zeile '%(recname)s' im Status 'Prüfen' oder 'Fertig' sein.

# model:ir.message,text:mds_recon_deny_line_not_check
source: For the reconciliation '%(reconame)s' of the cashbook '%(bookname)s', all lines in the date range from '%(datefrom)s' to '%(dateto)s' must be in the 'Check' state.
de: Für die Abstimmung '%(reconame)s' des Kassenbuchs '%(bookname)s' müssen alle Zeilen im Datumsbereich von '%(datefrom)s' bis '%(dateto)s' im Zustand 'Prüfen' sein.

# model:ir.message,text:msg_line_deny_write_by_reconciliation
source: The line '%(recname)s' cannot be changed because the reconciliation '%(reconame)s'is 'Done'.
de: Die Zeile '%(recname)s' kann nicht geändert werden, da die Abstimmung '%(reconame)s' ist.

# model:ir.message,text:msg_recon_err_overlap
source: The date range overlaps with another reconciliation.
de: Der Datumsbereich überschneidet sich mit einer anderen Abstimmung.

# model:ir.message,text:msg_line_err_write_to_reconciled
source: For the date '%(datetxt)s' there is already a completed reconciliation. Use a different date.
de: Für das Datum '%(datetxt)s' gibt es bereits eine abgeschlossene Abstimmung. Verwenden Sie ein anderes Datum.

# model:ir.message,text:msg_recon_lines_no_linked
source: In the date range from %(date_from)s to %(date_to)s, there are still cashbook lines that do not belong to any reconciliation.
de: Im Datumsbereich von %(date_from)s bis %(date_to)s existieren noch Kassenbuchzeilen, die zu keiner Abstimmung gehören.

# model:ir.message,text:msg_recon_date_from_to_mismatch
source: The start date '%(datefrom)s' of the current reconciliation '%(recname)s' must correspond to the end date '%(dateto)s' of the predecessor.
de: Das Anfangsdatum '%(datefrom)s' der aktuellen Abstimmung '%(recname)s' muß dem Endedatum '%(dateto)s' des Vorgängers entsprechen.

# model:ir.message,text:msg_recon_predecessor_not_done
source: The predecessor '%(recname_p)s' must be in the 'Done' state before you can check the current reconciliation '%(recname_c)s'.
de: Der Vorgänger '%(recname_p)s' muss sich im Status 'Fertig' befinden, bevor Sie den aktuellen Abgleich '%(recname_c)s' prüfen können.

# model:ir.message,text:msg_line_bookingtype_in
source: Rev
de: Einn.

# model:ir.message,text:msg_line_bookingtype_spin
source: Rev/Sp
de: Einn./Spl.

# model:ir.message,text:msg_line_bookingtype_out
source: Exp
de: Ausg.

# model:ir.message,text:msg_line_bookingtype_spout
source: Exp/Sp
de: Ausg./Spl.

# model:ir.message,text:msg_line_bookingtype_mvin
source: from
de: von

# model:ir.message,text:msg_line_bookingtype_mvout
source: to
de: nach

# model:ir.message,text:msg_line_denywf_by_reference
source: The current line is managed by the cashbook line '%(recname)s', cashbook: '%(cbook)s'.
de: Die aktuelle Zeile wird durch die Kassenbuchzeile '%(recname)s' verwaltet, Kassenbuch: '%(cbook)s'.

# model:ir.message,text:msg_rep_reconciliation_fname
source: %(recname)s Reconciliation from %(date_from)s to %(date_to)s
de: %(recname)s Abstimmung von %(date_from)s bis %(date_to)s

# model:ir.message,text:msg_line_date_before_book
source: The date of the cashbook line '%(recname)s' cannot be earlier than the start date '%(datebook)s' of the cashbook.
de: Das Datum der Kassenbuchzeile '%(recname)s' kann nicht vor dem Anfangsdatum '%(datebook)s' des Kassenbuchs liegen.

# model:ir.message,text:msg_line_split_invalid_category
source: The category of the split booking line '%(splitrecname)s' does not match the posting type '%(booktype)s' of the line '%(recname)s'.
de: Die Kategorie der Splitbuchungszeile '%(splitrecname)s' paßt nicht zum Buchungstyp '%(booktype)s' der Zeile '%(recname)s'.

# model:ir.message,text:msg_line_invalid_category
source: The category of the booking line '%(recname)s' does not match the posting type '%(booktype)s'.
de: Die Kategorie der Buchungszeile '%(recname)s' paßt nicht zum Buchungstyp '%(booktype)s'.

# model:ir.message,text:msg_book_btype_with_lines
source: The type cannot be deleted on the cash book '%(cbname)s' because it still contains %(numlines)s lines.
de: Der Typ kann am Kassenbuch '%(cbname)s' nicht gelöscht werden, da es noch %(numlines)s Zeilen enthält.

# model:ir.message,text:msg_book_no_type_noopen
source: The cash book '%(bookname)s' has no type and therefore cannot be opened.
de: Das Kassenbuch '%(bookname)s' hat keinen Typ und kann daher nicht geöffnet werden.

# model:ir.message,text:msg_btype_general
source: General
de: Allgemein

# model:ir.message,text:msg_value_exists_in_store
source: The value already exists for the record.
de: Der Wert existiert für den Datensatz bereits.

# model:ir.message,text:msg_nosearch_with_date
source: Search with 'date' no allowed for field '%(fname)s' on model '%(model)s'.
de: Suche mit 'date' nicht erlaubt für Feld '%(fname)s' auf Modell '%(model)s'.

# model:res.group,name:group_cashbook
source: Cashbook
de: Kassenbuch

# model:res.group,name:group_cashbook_checkline
source: Cashbook - WF - Check
de: Kassenbuch - WF - Prüfen

# model:res.group,name:group_cashbook_doneline
source: Cashbook - WF - Done
de: Kassenbuch - WF - Fertig

# model:res.group,name:group_cashbook_admin
source: Cashbook - Administrator
de: Kassenbuch - Administrator

# model:ir.rule.group,name:rg_book_rw_owner
source: Owners: Cashbook read/write
de: Eigentümer: Kassenbuch schreiben

# model:ir.rule.group,name:rg_book_read_nonowner
source: Observers and Reviewers: Cashbook read
de: Beobachter und Bearbeiter: Kassenbuch lesen

# model:ir.rule.group,name:rg_split_write_adm
source: Administrators: Splitbooking line read/write
de: Administratoren: Splitbuchungszeile bearbeiten

# model:ir.rule.group,name:rg_book_write_adm
source: Administrators: Cashbook read/write
de: Administratoren: Kassenbuch bearbeiten

# model:ir.rule.group,name:rg_line_write_adm
source: Administrators: Cashbook line read/write
de: Administratoren: Kassenbuchzeile bearbeiten

# model:ir.rule.group,name:rg_split_write
source: Owners and reviewers: Splitbooking line write
de: Eigentümer und Bearbeiter: Splitbuchungszeile bearbeiten

# model:ir.rule.group,name:rg_line_write
source: Owners and reviewers: Cashbook line write
de: Eigentümer und Bearbeiter: Kassenbuchzeile bearbeiten

# model:ir.rule.group,name:rg_split_read
source: Observer: Splitbooking line read
de: Beobachter: Splitbuchungszeile lesen

# model:ir.rule.group,name:rg_line_read
source: Observer: Cashbook line read
de: Beobachter: Kassenbuchzeile lesen

# model:ir.rule.group,name:rg_line_read
source: User in companies
de: Benutzer im Unternehmen

# model:ir.rule.group,name:rg_split_companies
source: User in companies
de: Benutzer im Unternehmen

# model:ir.rule.group,name:rg_type_companies
source: User in companies
de: Benutzer im Unternehmen

# model:ir.rule.group,name:rg_book_companies
source: User in companies
de: Benutzer im Unternehmen

# model:ir.rule.group,name:rg_recon_companies
source: User in companies
de: Benutzer im Unternehmen

# model:ir.rule.group,name:rg_recon_write_adm
source: Administrators: Reconciliation read/write
de: Administratoren: Abstimmung bearbeiten

# model:ir.rule.group,name:rg_recon_write
source: Owners and reviewers: Reconciliation write
de: Eigentümer und Bearbeiter: Abstimmung bearbeiten

# model:ir.ui.menu,name:menu_cashbook
source: Cashbook
de: Kassenbuch

# model:ir.ui.menu,name:menu_config
source: Configuration
de: Konfiguration

# model:ir.ui.menu,name:menu_typeconfig
source: Cashbook Type
de: Kassenbuchtyp

# model:ir.ui.menu,name:menu_booklist
source: Cashbook
de: Kassenbuch

# model:ir.ui.menu,name:menu_booktree
source: Cashbook
de: Kassenbuch

# model:ir.ui.menu,name:menu_open_lines
source: Open Cashbook
de: Kassenbuch öffnen

# model:ir.ui.menu,name:menu_category
source: Category
de: Kategorie

# model:ir.ui.menu,name:menu_category_list
source: Category
de: Kategorie

# model:ir.ui.menu,name:act_category_view
source: Category
de: Kategorie

# model:ir.ui.menu,name:menu_enter_booking
source: Enter Booking
de: Buchung eingeben

# model:ir.action,name:act_book_view
source: Cashbook
de: Kassenbuch

# model:ir.action,name:act_book_tree
source: Cashbook
de: Kassenbuch

# model:ir.action,name:act_type_view
source: Cashbook Type
de: Kassenbuchtyp

# model:ir.action,name:act_line_view2
source: Cashbook Line
de: Kassenbuchzeile

# model:ir.action,name:act_open_lines
source: Open Cashbook
de: Kassenbuch öffnen

# model:ir.action,name:act_open_tree_lines
source: Open Cashbook
de: Kassenbuch öffnen

# model:ir.action,name:report_cashbook
source: Cashbook
de: Kassenbuch

# model:ir.action,name:act_wizard_report
source: Cashbook Report
de: Kassenbuch Bericht

# model:ir.action,name:act_enterbooking_wiz
source: Enter Booking
de: Buchung eingeben

# model:ir.action.act_window.domain,name:act_line_domain_current
source: Current Month
de: aktueller Monat

# model:ir.action.act_window.domain,name:act_line_domain_last
source: Last Month
de: letzter Monat

# model:ir.action.act_window.domain,name:act_line_domain_all
source: All
de: Alle

# model:ir.action.act_window.domain,name:act_category_tree_domain_in
source: Revenue
de: Einnahmen

# model:ir.action.act_window.domain,name:act_category_tree_domain_out
source: Expense
de: Ausgaben

# model:ir.action.act_window.domain,name:act_category_list_domain_in
source: Revenue
de: Einnahmen

# model:ir.action.act_window.domain,name:act_category_list_domain_out
source: Expense
de: Ausgaben

# model:ir.model.button,string:line_wfedit_button
source: Edit
de: Bearbeiten

# model:ir.model.button,string:line_wfcheck_button
source: Check
de: Prüfen

# model:ir.model.button,string:line_wfrecon_button
source: Reconciled
de: Abgeglichen

# model:ir.model.button,string:line_wfdone_button
source: Done
de: Fertig

# model:ir.model.button,string:book_wfopen_button
source: Open
de: Öffnen

# model:ir.model.button,help:book_wfopen_button
source: An open cashbook can be edited.
de: Ein geöffnetes Kassenbuch kann bearbeitet werden.

# model:ir.model.button,string:book_wfclosed_button
source: Close
de: Schliessen

# model:ir.model.button,help:book_wfclosed_button
source: A closed cashbook can no longer be booked. However, it can be reopened afterwards.
de: Ein geschlossenes Kassenbuch kann nicht mehr bebucht werden. Es kann jedoch danach wieder geöffnet werden.

# model:ir.model.button,string:book_wfarchive_button
source: Archive
de: Archiv

# model:ir.model.button,help:book_wfarchive_button
source: An archived cashbook is locked.
de: Ein archiviertes Kassenbuch ist gesperrt.

# model:ir.model.button,string:book_addrecon_button
source: Add Reconciliation
de: Abstimmung hinzufügen

# model:ir.model.button,help:book_addrecon_button
source: Adds an empty reconciliation to the current cashbook.
de: Fügt eine leere Abstimmung zum aktuellen Kassenbuch hinzu.

# model:ir.model.button,string:recon_wfedit_button
source: Edit
de: Bearbeiten

# model:ir.model.button,string:recon_wfcheck_button
source: Check
de: Prüfen

# model:ir.model.button,string:recon_wfdone_button
source: Done
de: Fertig

# model:ir.sequence.type,name:sequence_type_cashbook_line
source: Cashbook Line
de: Kassenbuchzeile

# model:cashbook.book,name:
source: Cashbook
de: Kassenbuch

# view:cashbook.book:
source: Balance
de: Saldo

# view:cashbook.book:
source: Owner and Authorizeds
de: Eigentümer und Autorisierte

# view:cashbook.book:
source: General Information
de: Allgemein

# view:cashbook.book:
source: Amount and Numbering
de: Betrag und Nummerierung

# view:cashbook.book:
source: Reconciliations
de: Abstimmungen

# view:cashbook.book:
source: Description
de: Beschreibung

# field:cashbook.book,description:
source: Description
de: Beschreibung

# field:cashbook.book,btype:
source: Type
de: Typ

# help:cashbook.book,btype:
source: A cash book with type can contain postings. Without type is a view.
de: Ein Kassenbuch mit Typ kann Buchungen enthalten. Ohne Typ ist eine Sicht.

# field:cashbook.book,state:
source: State
de: Status

# selection:cashbook.book,state:
source: Open
de: Geöffnet

# selection:cashbook.book,state:
source: Closed
de: Geschlossen

# selection:cashbook.book,state:
source: Archive
de: Archiv

# field:cashbook.book,owner:
source: Owner
de: Eigentümer

# field:cashbook.book,reviewer:
source: Reviewer
de: Bearbeiter

# help:cashbook.book,reviewer:
source: Group of users who have write access to the cashbook.
de: Gruppe von Benutzern, die Schreibzugriff auf das Kassenbuch haben.

# field:cashbook.book,observer:
source: Observer
de: Betrachter

# help:cashbook.book,observer:
source: Group of users who have read-only access to the cashbook.
de: Gruppe von Benutzern, die nur Lesezugriff auf das Kassenbuch haben.

# field:cashbook.book,company:
source: Company
de: Unternehmen

# field:cashbook.book,currency:
source: Currency
de: Währung

# field:cashbook.book,currency_digits:
source: Currency Digits
de: Nachkommastellen Währung

# field:cashbook.book,start_date:
source: Initial Date
de: Anfangsdatum

# field:cashbook.book,balance:
source: Balance
de: Saldo

# help:cashbook.book,balance:
source: Balance of bookings to date
de: Saldo der Buchungen bis zum heutigen Tag

# field:cashbook.book,balance_all:
source: Total balance
de: Gesamtsaldo

# help:cashbook.book,balance_all:
source: Balance of all bookings
de: Saldo aller Buchungen

# field:cashbook.book,reconciliations:
source: Reconciliations
de: Abstimmungen

# field:cashbook.book,lines:
source: Lines
de: Zeilen

# field:cashbook.book,number_sequ:
source: Line numbering
de: Zeilennummerierung

# help:cashbook.book,number_sequ:
source: Number sequence for numbering of the cash book lines.
de: Zahlenfolge zur Nummerierung der Kassenbuchzeilen.

# field:cashbook.book,number_atcheck:
source: number when 'Checking'
de: nummerieren beim 'Prüfen'

# help:cashbook.book,number_atcheck:
source: The numbering of the lines is done in the step Check. If the check mark is inactive, this happens with Done.
de: Die Nummerierung der Zeilen wird beim Schritt 'Prüfen' erledigt. Bei inaktivem Häkchen passiert dies erst bei 'Fertig'.

# field:cashbook.book,parent:
source: Parent
de: Übergeordnet

# field:cashbook.book,childs:
source: Children
de: Untergeordnet

# field:cashbook.book,balance_ref:
source: Balance (Ref.)
de: Saldo (Ref.)

# help:cashbook.book,balance_ref:
source: Balance in company currency
de: Saldo in der Unternehmenswährung

# field:cashbook.book,company_currency:
source: Company Currency
de: Unternehmenswährung

# field:cashbook.book,company_currency_digits:
source: Currency Digits (Ref.)
de: Nachkommastellen Währung (Ref.)

# field:cashbook.book,feature:
source: Feature
de: Merkmal

# field:cashbook.book,booktransf_feature:
source: Feature
de: Merkmal

# field:cashbook.book,value_store:
source: Values
de: Werte

# model:cashbook.split,name:
source: Split booking line
de: Splitbuchungszeile

# view:cashbook.split:
source: Description
de: Beschreibung

# view:cashbook.split:
source: Amount
de: Betrag

# field:cashbook.split,line:
source: Line
de: Zeile

# field:cashbook.split,description:
source: Description
de: Beschreibung

# field:cashbook.split,category:
source: Category
de: Kategorie

# field:cashbook.split,category_view:
source: Category
de: Kategorie

# field:cashbook.split,amount:
source: Amount
de: Betrag

# field:cashbook.split,currency:
source: Currency
de: Währung

# field:cashbook.split,currency_digits:
source: Currency Digits
de: Nachkommastellen Währung

# field:cashbook.split,bookingtype:
source: Type
de: Typ

# selection:cashbook.split,bookingtype:
source: Revenue
de: Einnahme

# selection:cashbook.split,bookingtype:
source: Revenue Splitbooking
de: Einnahme Splitbuchung

# selection:cashbook.split,bookingtype:
source: Expense
de: Ausgabe

# selection:cashbook.split,bookingtype:
source: Expense Splitbooking
de: Ausgabe Splitbuchung

# selection:cashbook.split,bookingtype:
source: Transfer from
de: Umbuchung von

# selection:cashbook.split,bookingtype:
source: Transfer to
de: Umbuchung nach

# field:cashbook.split,state:
source: State
de: Status

# selection:cashbook.split,state:
source: Edit
de: Bearbeiten

# selection:cashbook.split,state:
source: Checked
de: Geprüft

# selection:cashbook.split,state:
source: Reconciled
de: Abgeglichen

# selection:cashbook.split,state:
source: Done
de: Fertig

# field:cashbook.split,state_cashbook:
source: State of Cashbook
de: Kassenbuchstatus

# field:cashbook.split,splittype:
source: Type
de: Typ

# help:cashbook.split,splittype:
source: Type of split booking line
de: Typ der Splitbuchungszeile

# selection:cashbook.split,splittype:
source: Category
de: Kategorie

# selection:cashbook.split,splittype:
source: Transfer
de: Umbuchung

# field:cashbook.split,target:
source: Target
de: Ziel

# selection:cashbook.split,target:
source: Cashbook
de: Kassenbuch

# selection:cashbook.split,target:
source: Category
de: Kategorie

# field:cashbook.split,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.split,owner_cashbook:
source: Owner
de: Eigentümer

# field:cashbook.split,booktransf:
source: Source/Dest
de: Quelle/Ziel

# field:cashbook.split,currency2nd:
source: 2nd Currency
de: Fremdwährung

# field:cashbook.split,currency2nd_digits:
source: 2nd Currency Digits
de: Nachkommastellen Fremdwährung

# field:cashbook.split,amount_2nd_currency:
source: Amount Second Currency
de: Fremdwährungsbetrag

# field:cashbook.split,rate_2nd_currency:
source: Rate
de: Kurs

# help:cashbook.split,rate_2nd_currency:
source: Exchange rate between the currencies of the participating cashbooks.
de: Wechselkurs zwischen der Währungen der beteiligten Kassenbücher.

# field:cashbook.split,feature:
source: Feature
de: Merkmal

# field:cashbook.split,booktransf_feature:
source: Feature
de: Merkmal

# model:cashbook.line,name:
source: Cashbook Line
de: Kassenbuchzeile

# view:cashbook.line:
source: Cashbook Line
de: Kassenbuchzeile

# view:cashbook.line:
source: Description
de: Beschreibung

# view:cashbook.line:
source: State
de: Status

# view:cashbook.line:
source: Split booking lines
de: Splitbuchungszeilen

# view:cashbook.line:
source: References
de: Referenzen

# field:cashbook.line,cashbook:
source: Cashbook
de: Kassenbuch

# field:cashbook.line,date:
source: Date
de: Datum

# field:cashbook.line,description:
source: Description
de: Beschreibung

# field:cashbook.line,descr_short:
source: Description
de: Beschreibung

# field:cashbook.line,state:
source: State
de: Status

# selection:cashbook.line,state:
source: Edit
de: Bearbeiten

# selection:cashbook.line,state:
source: Checked
de: Geprüft

# selection:cashbook.line,state:
source: Reconciled
de: Abgeglichen

# selection:cashbook.line,state:
source: Done
de: Fertig

# field:cashbook.line,month:
source: Month
de: Monat

# field:cashbook.line,category:
source: Category
de: Kategorie

# field:cashbook.line,category_view:
source: Category
de: Kategorie

# field:cashbook.line,bookingtype:
source: Type
de: Typ

# help:cashbook.line,bookingtype:
source: Type of Booking
de: Typ der Buchung

# selection:cashbook.line,bookingtype:
source: Revenue
de: Einnahme

# selection:cashbook.line,bookingtype:
source: Revenue Splitbooking
de: Einnahme Splitbuchung

# selection:cashbook.line,bookingtype:
source: Expense
de: Ausgabe

# selection:cashbook.line,bookingtype:
source: Expense Splitbooking
de: Ausgabe Splitbuchung

# selection:cashbook.line,bookingtype:
source: Transfer from
de: Umbuchung von

# selection:cashbook.line,bookingtype:
source: Transfer to
de: Umbuchung nach

# field:cashbook.line,company:
source: Company
de: Unternehmen

# field:cashbook.line,amount:
source: Amount
de: Betrag

# field:cashbook.line,debit:
source: Debit
de: Ausgabe

# field:cashbook.line,credit:
source: Credit
de: Einnahme

# field:cashbook.line,currency:
source: Currency
de: Währung

# field:cashbook.line,currency_digits:
source: Currency Digits
de: Nachkommastellen Währung

# field:cashbook.line,balance:
source: Balance
de: Saldo

# help:cashbook.line,balance:
source: Balance of the cash book up to the current line, if the default sorting applies.
de: Saldo des Kassenbuchs bis zur aktuellen Zeile, sofern die Standardsortierung gilt.
