Repository: pypi-data/pypi-mirror-392
Catalog: packages/pretix-nets-easy/pretix_nets_easy-1.0.0-py3-none-any.whl/pretix_nets_easy/locale/*/LC_MESSAGES/django.po
Languages: da

source: nets Easy Payments
da: nets Easy betaling

source: Accept payments through the nets (formerly DIBS) Easy payment gateway
da: Acceptér betalinger gennem nets (tidl. DIBS) Easy betalings gateway

source: The provided key "%(value)s" does not look valid. It should start with "%(prefix)s".
da: Den indtastede nøgle "%(value)s" ser ikke ud til at være gyldig. Den skal starte med "%(prefix)s".

source: Payment method name
da: Navn på betalingsmetode

source: Since pretix cannot deduce the available payment methods on the hosted Payment Page, it cannot display a choice of allowed payment methods to the customer. You will need to name choice of this payment method to your liking. You could for example provide a list of all allowed payment methods like "Credit Card, Invoice".
da: Pretix kan ikke udlede den tilgængelige betalingsmetode på den hostede betalingsside derfor kan den ikke vise mulige, tilladte betalingsmetoder til kunden. Du bør navngive valgmulighederne for denne betalingsmetode. Du kan f.eks. lave en liste over alle tilladte betalingsmetoder såsom Kreditkort, Faktura mfl.

source: Terms & Conditions URL
da: URL til vilkår og betingelser

source: Link to your shops terms and conditions, as required by your payment processor.
da: Link til din butiks vilkår og betingelser, som din betalingsudbyder kræver.

source: Test Secret Key
da: Test hemmelig nøgle

source: Test Checkout Key
da: Test checkout nøgle

source: Live Secret Key
da: Live hemmelig nøgle

source: Live Checkout Key
da: Live checkout nøgle

source: Credit Card, Invoice, Digital Wallets
da: Kreditkort, faktura, digitale "wallets"

source: The nets Easy plugin is operating in test mode. You can use one of <a {cardargs}>many test cards</a> or <a {invoiceargs}>invoice test addresses</a> to perform a transaction. No money will actually be transferred.
da: Plugin til nets Easy er pt. i testtilstand. Du kan anvende et af de <a {cardargs}>mange testkort</a> eller <a {invoiceargs}>faktura test-adresser</a> til at gennemføre en transaktion. Ingen penge vil blive overført.

source: We had trouble communicating with the payment service. Please try again and get in touch with us if this problem persists.
da: Vi havde problemer med at kommunikere med betalingsservicen. Prøv venligst igen og tag kontakt til os, hvis problemet fortsætter.

source: Nets Easy reported an event: {}.
da: Nets Easy indrapporterede en begivenhed: {}.

source: After you submitted your order, we will redirect you to the payment service provider to complete your payment. You will then be redirected back here to get your tickets.
da: Din betaling vil blive behandlet af arrangørens betalingsudbyder. Dine data sendes direkte til udbyderen og rør derfor aldrig vores servere.

source: Payment method
da: Betalingsmetode

source: Your payment will be processed by the organizers payment processor. Your data will be transmitted directly to them and never touches our servers.
da: Din betaling vil blive behandlet af arrangørens betalingsudbyder. Dine data sendes direkte til udbyderen og rør derfor aldrig vores servere.

source: Payment ID
da: Betalings ID

source: Charge ID
da: Opkrævnings ID

source: Refund ID
da: Refunderings ID

source: Payment Type
da: Betalingstype

source: Payment Method
da: Betalingsmetode

source: Payment Card
da: Betalingskort

source: Expiry
da: Udløbsdato

source: Pay order
da: Betal ordre

source: Pay order: %(code)s
da: Betal ordre: %(code)s

source: Please turn on JavaScript.
da: Aktivér venligt JavaScript.

source: Please use the button/form below to complete your payment.
da: Brug venligst nedenstående knap/formular til at udføre din betaling.

source: Cancel
da: Annullér

source: Sorry, there was an error in the payment process. Please try again.
da: Vi beklager, der opstod en fejl i betalingsprocessen. Prøv venligst igen.
