Repository: pypi-data/pypi-mirror-392
Catalog: packages/wafer-debconf/wafer_debconf-0.17.0-py3-none-any.whl/minidebconf/locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Full name
pt_br: Nome completo

source: Involvement
pt_br: Envolvimento

source: Accomodation
pt_br: Hospedagem

source: Food
pt_br: Almoço

source: Travel
pt_br: Viagem

source: I would like to stay at the conference-arranged accommodation
pt_br: Gostaria de ficar na hospedagem fornecida pelo evento

source: I would like to have the conference-arranged meals
pt_br: Gostaria de almoçar no restaurante pago pelo evento

source: I would like to request reimbursement of my travel costs
pt_br: Gostaria de pedir reembolso das minhas passagens para a viagem

source: Estimated travel cost (upper bound, in %(currency)s)
pt_br: Custo estimado das passagens (valor máximo, em %(currency)s)

source: <p><a href='%s' target='_blank'>See this page</a> for more information about shirt sizes.</p>
pt_br: <p><a href='%s' target='_blank'>Veja esta página</a> para mais informações sobre tamanhos de camiseta.</p>

source: T-Shirt
pt_br: Camiseta

source: <p><a href='%s' target='_blank'>See this page</a> for more information about bursaries.</p>
pt_br: <p><a href='%s' target='_blank'>Veja esta página</a> para mais informações sobre bolsas.</p>

source: Bursaries
pt_br: Bolsas

source: Home page
pt_br: Página inicial

source: About
pt_br: Sobre

source: about
pt_br: sobre

source: About the event
pt_br: Sobre o evento

source: event
pt_br: evento

source: Code of Conduct
pt_br: Código de conduta

source: coc
pt_br: cdc

source: Organizers
pt_br: Organização

source: Contribute
pt_br: Contribuir

source: contribute
pt_br: contribuir

source: Call for Proposals
pt_br: Chamada de Palestras

source: Important dates
pt_br: Datas importantes

source: important-dates
pt_br: Datas importantes

source: Schedule
pt_br: Programação

source: Beginner
pt_br: Iniciante

source: User
pt_br: Usuário(a)

source: Contributor
pt_br: Contribuidor(a)

source: Debian Maintainer (DM)
pt_br: Mantenedor(a) Debian (DM)

source: Debian Developer (DD)
pt_br: Desenvolvedor(a) Debian (DD)

source: Description
pt_br: Descrição

source: Diet
pt_br: Dieta

# conference
source: registration
pt_br: inscrição

# conference
source: registrations
pt_br: inscrições

source: Phone number
pt_br: Número de telefone

source: Level of involvement with Debian
pt_br: Nível de envolvimento com o Debian

source: Gender
pt_br: Gênero

source: Country
pt_br: País

source: City/State or Province
pt_br: Cidade - UF

source: Shirt size
pt_br: Tamanho de camiseta

source: Conference-arranged accommodation
pt_br: Hospedagem organizada pelo evento

source: Check-in date
pt_br: Data de check-in

source: Check-out date
pt_br: Data de check-out

source: Conference-arranged food
pt_br: Alimentação organizada pelo evento

source: Reimburse travel costs
pt_br: Reembolso de custos de viagem

source: Travel costs
pt_br: Custos de viagem

source: Notes
pt_br: Notas - se você pediu bolsa, descreva suas contribuições para o Debian e seus planos para a MiniDebConf

source: Which days you will attend
pt_br: Quais dias você participará?

# conference
source: Update registration
pt_br: Atualizar inscrição

# conference
source: Register
pt_br: Realizar inscrição

source: Cancel registration
pt_br: Cancelar inscrição

source: Are you sure you want to cancel your registration? You can register again later if you change your mind.
pt_br: Tem certeza que quer cancelar a sua inscrição? Você pode se inscrever de novo mais tarde, se mudar de ideia.

source: No, abort
pt_br: Não, cancelar

source: Yes, I'm sure
pt_br: Sim, tenho certeza

source: Registration complete
pt_br: Inscrição realizada

source: Your registration was completed with success.
pt_br: Sua inscrição foi realizada com sucesso.

source: If you need to update any information, you can use the "Update Registration" button on your profile page.
pt_br: Se você precisar atualizar alguma informação, você pode usar o botão "Atualizar inscrição" na página do seu perfil.
