Repository: pypi-data/pypi-mirror-392
Catalog: packages/noggin-aaa/noggin_aaa-1.11.0-py3-none-any.whl/noggin/translations/*/LC_MESSAGES/messages.po
Languages: it

source: Password expired. Please reset it.
it: Password scaduta, per favore esegui il reset.

source: Could not log in to the IPA server.
it: impossibile accedere al server IPA.

source: Welcome, %(username)s!
it: Benvenuto, %(username)s!

source: Token successfully synchronized
it: Token sincronizzato con successo

source: User %(username)s was not found in the system.
it: L'utente %(username)s non è stato trovato nel sistema.

source: Unable to add user %(username)s: %(errormessage)s
it: Impossibile aggiunger l'utente %(username)s: %(errormessage)s

source: You got it! %(username)s has been added to %(groupname)s.
it: Ce lai fatta! %(username)s è stato creato in %(groupname)s.

source: You got it! %(username)s has been removed from %(groupname)s.
it: Ce l'ha fatta! %(username)s è stato rimosso da %(groupname)s.

source: You got it! %(username)s is no longer a sponsor of %(groupname)s.
it: Hai indovinato! %(username)s non è più sponsor di %(groupname)s.

source: The old password or username is not correct
it: La vecchia password o il vecchio nome utente non sono corretti

source: Could not change password.
it: Impossibile modificare la password.

source: Your password has been changed
it: La tua password è stata modifica

source: You have already requested a password reset, you need to wait %(wait_min)s minute(s) and %(wait_sec)s seconds before you can request another.
it: È già stata richiesta una reimpostazione della password; è necessario attendere %(wait_min)s minuti e %(wait_sec)s secondi prima di poterne richiedere un'altra.

source: User %(username)s does not exist
it: L'utente %(username)s non esiste

source: We could not send you an email, please retry later
it: Non è stato possibile inviarle un'e-mail, la preghiamo di riprovare più tardi

source: Your email address is rejected by smtp server
it: Il tuo indirizzo email è stato rifiutato dal server smtp

source: An email has been sent to your address with instructions on how to reset your password
it: È stata inviata un'e-mail al vostro indirizzo con le istruzioni per reimpostare la password

source: The token is invalid, please request a new one.
it: Il token non è valido, richiederne uno nuovo.

source: The token has expired, please request a new one.
it: Il token è scaduto, richiederne uno nuovo.

source: Your password has been changed since you requested this token, please request a new one.
it: La password è stata modificata da quando si è richiesto questo token; si prega di richiederne una nuova.

source: Your password has been changed, but it does not comply with the policy (%(policy_error)s) and has thus been set as expired. You will be asked to change it after logging in.
it: La password è stata modificata, ma non è conforme alla policy (%(policy_error)s) e quindi è stata impostata come scaduta. Vi verrà chiesto di cambiarla dopo l'accesso.

source: Incorrect value.
it: Valore non corretto.

source: Could not change password, please try again.
it: Impossibile cambiare la password, per favore riprova.

source: Your password has been changed.
it: La password è stata modificata.

source: Verify your email address
it: Verifica il tuo indirizzo email

source: We could not send you the address validation email, please retry later
it: Non siamo riusciti a inviarti l'email di convalida dell'indirizzo, riprova più tardi

source: The username '%(username)s' or the email address '%(email)s' are already taken.
it: Il nome utente '%(username)s' o l'indirizzo email '%(email)s' sono già stati utilizzati.

source: An error occurred while creating the account, please try again.
it: Si è verificato un errore durante la creazione dell'account, riprovare.

source: The registration seems to have failed, please try again.
it: La registrazione sembra essere fallita, ti preghiamo di riprovare.

source: The address validation email has be sent again. Make sure it did not land in your spam folder
it: L'email di convalida dell'indirizzo è stata inviata nuovamente. Assicurati che non sia finita nella cartella dello spam

source: No token provided, please check your email validation link.
it: Nessun token fornito, controlla il link di convalida presente nell'email.

source: The token is invalid, please register again.
it: Il token non è valido, ti preghiamo di registrarti nuovamente.

source: This token is no longer valid, please register again.
it: Questo token non è più valido, ti preghiamo di registrarti nuovamente.

source: This user cannot be found, please register again.
it: Questo utente non può essere trovato, ti preghiamo di registrarti nuovamente.

source: The username and the email address don't match the token you used, please register again.
it: Il nome utente e l'indirizzo email non corrispondono al token utilizzato, ti preghiamo di registrarti nuovamente.

source: Something went wrong while creating your account, please try again later.
it: Si è verificato un errore durante la creazione del tuo account, ti preghiamo di riprovare più tardi.

source: Your account has been created, but the password you chose does not comply with the policy (%(policy_error)s) and has thus been set as expired. You will be asked to change it after logging in.
it: Il vostro account è stato creato, ma la password che avete scelto non è conforme alla policy (%(policy_error)s) e quindi è stata impostata come scaduta. Vi verrà chiesto di cambiarla dopo l'accesso.

source: Your account has been created, but an error occurred while setting your password (%(message)s). You may need to change it after logging in.
it: Il tuo account è stato creato, ma si è verificato un errore durante l’impostazione della password (%(message)s). Potrebbe essere necessario cambiarla dopo aver effettuato l’accesso.

source: Congratulations, your account has been created! Welcome, %(name)s.
it: Congratulazioni, il tuo account è stato creato! Benvenuto, %(name)s.

source: Congratulations, your account has been created! Go ahead and sign in to proceed.
it: Congratulazioni, il tuo account è stato creato! Procedi con l’accesso per continuare.

source: All
it: Tutti

source: Unknown
it: Sconosciuto

source: Not Spam
it: Non spam

source: Awaiting
it: In attesa

source: Registration is closed at the moment.
it: Le registrazioni sono chiuse in questo momento.

source: The email address %(mail)s needs to be validated. Please check your inbox and click on the link to proceed. If you can't find the email in a couple minutes, check your spam folder.
it: L'indirizzo email %(mail)s deve essere convalidato. Controlla la tua casella di posta e clicca sul link per procedere. Se non trovi l'email entro qualche minuto, controlla la cartella dello spam.

source: No modifications.
it: Nessuna modifica.

source: The token is invalid, please set the email again.
it: Il token non è valido, si prega di impostare nuovamente l'email.

source: This token is no longer valid, please set the email again.
it: Questo token non è più valido, si prega di impostare nuovamente l'email.

source: This token does not belong to you.
it: Questo token non ti appartiene.

source: Incorrect password
it: Password errata

source: Cannot create the token.
it: Impossibile creare il token.

source: The token has been created.
it: Il token è stato creato.

source: Cannot rename the token.
it: Impossibile rinominare il token.

source: Sorry, You cannot disable your last active token.
it: Spiacenti, non puoi disabilitare il tuo ultimo token attivo.

source: Cannot disable the token.
it: Impossibile disabilitare il token.

source: Cannot enable the token. %(errormessage)s
it: Impossibile abilitare il token. %(errormessage)s

source: Sorry, You cannot delete your last active token.
it: Spiacenti, non puoi eliminare il tuo ultimo token attivo.

source: Cannot delete the token.
it: Impossibile eliminare il token.

source: Unknown agreement: %(name)s.
it: Accordo sconosciuto: %(name)s.

source: Cannot sign the agreement "%(name)s": %(error)s
it: Impossibile firmare l'accordo "%(name)s": %(error)s

source: You signed the "%(name)s" agreement.
it: Hai firmato l'accordo "%(name)s".

source: This does not look like a valid nickname.
it: Questo non sembra un nickname valido.

source: This does not look like a valid server name.
it: Questo non sembra un nome server valido.

source: First Name
it: Nome

source: First name must not be empty
it: Il nome non può essere vuoto

source: Last Name
it: Cognome

source: Last name must not be empty
it: Il cognome non può essere vuoto

source: Locale must not be empty
it: La località non può essere vuota

source: Locale must be a valid locale short-code
it: La località deve essere un codice locale valido

source: Chat Nicknames
it: Soprannomi in chat

source: Timezone
it: Fuso orario

source: Timezone must not be empty
it: Il fuso orario non può essere vuoto

source: Timezone must be a valid timezone
it: Il fuso orario deve essere valido

source: GitHub Username
it: Nome utente GitHub

source: GitLab Username
it: Nome utente GitLab

source: Website or Blog URL
it: URL del sito web o blog

source: Valid URL required
it: È richiesto un URL valido

source: Private
it: Privato

source: Hide information from other users, see the Privacy Policy for details.
it: Nascondi le informazioni agli altri utenti, consulta la Politica sulla Privacy per i dettagli.

source: Pronouns
it: Pronomi

source: E-mail Address
it: Indirizzo email

source: Email must not be empty
it: L'email non può essere vuota

source: Email must be valid
it: L'email deve essere valida

source: Red Hat Bugzilla Email
it: Email di Red Hat Bugzilla

source: SSH Keys
it: Chiavi SSH

source: GPG Keys
it: Chiavi GPS

source: Token name
it: Nome del token

source: Add an optional name to help you identify this token
it: Aggiungi un nome opzionale per aiutarti

source: Enter your current password
it: Inserisci la tua password attuale

source: You must provide a password
it: Devi fornire una password

source: please reauthenticate so we know it is you
it: Per favore, effettua nuovamente l'autenticazione così sappiamo che sei tu

source: One-Time Password
it: Password monouso

source: Enter your One-Time Password
it: Inserisci la tua password monouso

source: Generate OTP Token
it: Genera token OTP

source: Could not find the token secret
it: Impossibile trovare il token segreto.

source: Verification Code
it: Codice di verifica

source: You must provide a verification code
it: Devi fornire un codice di verifica

source: Verify and Enable OTP Token
it: Verifica e abilita il token OTP

source: The code is wrong, please try again.
it: Il codice è sbagliato, riprova per favore.

source: Token must not be empty
it: Il nome non deve essere vuoto

source: Agreement must not be empty
it: L'accordo non deve essere vuoto

source: New member username must not be empty
it: Il nome utente del nuovo membro non deve essere vuoto

source: Username
it: Nome utente

source: Username must not be empty
it: Il nome utente non deve essere vuoto

source: You must provide a user name
it: Devi fornire un nome utente

source: Log In
it: Accedi

source: New Password
it: Nuova password

source: Password must not be empty
it: La password non deve essere vuota

source: Passwords must match
it: Le password devono corrispondere

source: Confirm New Password
it: Conferma nuova password

source: One-Time Password (if your account has Two-Factor Authentication enabled)
it: Password monouso (se il tuo account ha l'autenticazione a due fattori abilitata)

source: Current Password
it: Password corrente

source: Current password must not be empty
it: La password attuale non deve essere vuota

source: User name must not be empty
it: Il nome utente non deve essere vuoto

source: Enter your username to reset your password
it: Inserisci il tuo nome utente per reimpostare la password

source: Only these characters are allowed: "%(chars)s".
it: Sono consentiti solo questi caratteri: "%(chars)s".

source: I am over 16 years old
it: Ho più di 16 anni

source: You must be over 16 years old to create an account
it: Devi avere più di 16 anni per creare un account

source: Register
it: Registrati

source: Resend email
it: Invia di nuovo l'email

source: Please choose a strong password
it: Si prega di scegliere una password sicura

source: Confirm Password
it: Conferma password

source: Activate
it: Attiva

source: First OTP
it: Primo OTP

source: You must provide a first code
it: Devi fornire un primo codice

source: Second OTP
it: Secondo OTP

source: You must provide a second code
it: Devi fornire un secondo codice

source: Token ID
it: ID del token

source: Email addresses from that domain are not allowed
it: Gli indirizzi email di quel dominio non sono consentiti

source: Mixed case is not allowed, try lower case.
it: Il testo con lettere maiuscole e minuscole non è consentito, prova con tutte minuscole.

source: Field must not match "%(pattern)s".
it: Il campo non deve corrispondere a "%(pattern)s".

source: That page wasn't found.
it: Pagina non trovata.

source: Forgot Password?
it: Password dimenticata?

source: Forgot Password or OTP?
it: Password o OTP dimenticati?

source: Sync Token
it: Sincronizza Token

source: Previous
it: Indietro

source: current
it: Corrente

source: Next
it: Avanti

source: Groups
it: Gruppi

source: Users
it: Utenti

source: Password Recovery
it: Recupero password

source: Did you forget your password?
it: Hai dimenticato la password?

source: Enter your username and an email will be sent to your address with further instructions.
it: Inserisci il tuo nome utente e verrà inviata un'email al tuo indirizzo con ulteriori istruzioni.

source: Send
it: Invia

source: Reset Password
it: Resetta password

source: Password Reset for %(username)s
it: Reimpostazione password per %(username)s

source: %(groupname)s Group
it: Gruppo %(groupname)s

source: You are a sponsor of this group, but not a member. Add yourself if you want to be a member.
it: Sei sponsor di questo gruppo, ma non un membro. Aggiungiti se vuoi diventare membro.

source: To join this group, contact a group sponsor.
it: Per unirti a questo gruppo, contatta uno sponsor del gruppo.

source: Sponsors
it: Sponsor

source: no sponsors
it: nessuno sponsor

source: Members
it: Membri

source: add user...
it: aggiungi utente..

source: Leave group
it: Esci dal gruppo

source: No members yet.
it: Nessun membro ancora.

source: Group List
it: Lista gruppo

source: %(member_count)s members
it: %(member_count)s membri

source: No groups.
it: Nessun gruppo.

source: Login
it: Accesso

source: IPA Error
it: Errore IPA

source: There was a problem with the IPA backend, please try again later.
it: Si è verificato un problema con il backend IPA, riprova più tardi.

source: You can also <a href="%(url)s">log out</a> and log back in if the problem persists.
it: Puoi anche <a href="%(url)s">disconnetterti</a> e accedere di nuovo se il problema persiste.

source: Expired Password Reset
it: Reimpostazione password scaduta

source: Expired Password Reset for %(username)s
it: Reimpostazione password scaduta per %(username)s

source: Change Password
it: Cambia password

source: Registering Users
it: Registrazioni utenti

source: Name:
it: Nome:

source: Registered:
it: Registrato.

source: Status:
it: Stato:

source: Waiting for spam check
it: In attesa del controllo antispam

source: Not flagged as spam
it: Non segnalato come spam

source: Flagged as spam
it: Segnalato come spam

source: Spam status unknown
it: Stato spam sconosciuto

source: Accept
it: accetta

source: Flag as spam
it: Segnala come spam

source: Delete
it: Cancella

source: Clicking on Accept will send the validation email to this user. Other buttons will not send anything.
it: Cliccando su Accetta verrà inviata l’email di convalida a questo utente. Gli altri pulsanti non invieranno nulla.

source: No registering users in this state at the moment.
it: Al momento non ci sono utenti in registrazione in questo stato.

source: No registering users at the moment.
it: Al momento non ci sono utenti in registrazione.

source: Activate your account
it: Attiva il tuo account

source: Account creation, step 3/3
it: Creazione account, step 3/3

source: Hello %(name)s. To activate your account, please choose a password.
it: Ciao %(name)s. Per attivare il tuo account, scegli una password.

source: Validate your email address
it: Convalida il tuo indirizzo email

source: Account creation, step 2/3
it: Creazione account, step 2/3

source: Congratulations %(name)s, your account has been created!
it: Congratulazioni %(name)s, il tuo account è stato creato!

source: Before you can log in, your email address: %(mail)s needs to be validated. Please check your inbox and click on the link to proceed.
it: Prima di poter effettuare il login, il tuo indirizzo email: %(mail)s deve essere convalidato. Controlla la tua casella di posta e clicca sul link per procedere.

source: If you can't find the email in a couple minutes, check your spam folder. If it's not there, you can ask for another validation email by clicking on the button below.
it: Se non trovi l'email entro qualche minuto, controlla la cartella dello spam. Se non è lì, puoi richiedere un'altra email di convalida cliccando sul pulsante qui sotto.

source: Spam check in progress
it: Controllo antispam in corso.

source: Your account is being checked
it: Il tuo account è in fase di controllo

source: Before you can log in, your account needs to be check for spam likelihood. It should only take a few seconds, please wait...
it: Prima di poter effettuare il login, il tuo account deve essere verificato per la probabilità di spam. Dovrebbe richiedere solo pochi secondi, ti preghiamo di attendere...

source: Your account requires admin approval
it: Il tuo account richiede l'approvazione dell'amministratore

source: Your account needs to be approved by an administrator.
it: Il tuo account deve essere approvato da un amministratore.

source: You will receive an email when the decision has been taken.
it: Riceverai un'email quando la decisione sarà stata presa.

source: Thank you for your patience.
it: Grazie per la tua pazienza.

source: Your account is blocked
it: Il tuo account è bloccato

source: Your account has been flagged as spam.
it: Il tuo account è stato contrassegnato come spam.

source: Something went wrong
it: Qualcosa non ha funzionato

source: Unsupported spam status: %s, please contact the administrators
it: Stato spam non supportato: %s, ti preghiamo di contattare gli amministratori

source: Sync OTP Token
it: Sincronizza il token OTP

source: Synchronize OTP Token
it: Sincronizza il token OTP

source: Sync
it: Sincronizza

source: View agreement
it: Vedi accordo

source: Sign
it: Firma

source: Sign User Agreement
it: Firma l'accordo utente

source: Validate your email
it: Verifica la tua email

source: Hello %(user_name)s. Do you want to set your %(attr_name)s to %(mail)s?
it: Ciao %(user_name)s. Vuoi impostare il tuo %(attr_name)s su %(mail)s?

source: Cancel
it: Annulla

source: Do it
it: Fallo

source: Save
it: Salva

source: GPG Key ID
it: ID Chiave GPG

source: SSH Public Key
it: Chiave pubblica SSH

source: Scan your new token
it: Scansiona il tuo nuovo token

source: Your new token is ready. Click on the button below to reveal the QR code and scan it.
it: Il tuo nuovo token è pronto. Clicca sul pulsante qui sotto per visualizzare il codice QR e scansionarlo.

source: or copy and paste the following token URL if you can't scan the QR code:
it: oppure copia e incolla il seguente URL del token se non riesci a scansionare il codice QR:

source: After enrolling the token in your application, verify it by generating your first code and entering it below:
it: Dopo aver registrato il token nella tua applicazione, verifica generando il tuo primo codice e inserendolo qui sotto:

source: Add OTP Token
it: Aggiungi OTP Token

source: Creating your first OTP token enables two-factor authentication using OTP.
it: Creare il tuo primo token OTP abilita l’autenticazione a due fattori tramite OTP.

source: Once enabled, two-factor authentication cannot be disabled.
it: Una volta abilitata, l’autenticazione a due fattori non può essere disattivata.

source: OTP Tokens
it: Token OTP

source: (no name)
it: (nessun nome)

source: Rename
it: Rinomina

source: Disable
it: Disabilita

source: Enable
it: Abilita

source: You have no OTP tokens
it: Non hai token OTP

source: Add an OTP token to enable two-factor authentication on your account.
it: Aggiungi un token OTP per abilitare l’autenticazione a due fattori sul tuo account.

source: Change Avatar
it: Cambia Avatar

source: The format is either <code>username</code> or <code>username:server.name</code> if you're not using the default servers:
it: The format is either <code>username</code> or <code>username:server.name</code> if you're not using the default servers:Il formato è <code>username</code> oppure <code>username\:server.name</code> se non stai usando i server predefiniti:

source: For %(title)s: <code>%(server)s</code>
it: Per %(title)s: <code>%(server)s</code>

source: Settings for %(username)s
it: Impostazioni per %(username)s

source: Profile
it: Profilo

source: Emails
it: Email

source: SSH &amp; GPG Keys
it: Chiavi SSH e GPG

source: Agreements
it: Contratto

source: Profile for %(username)s
it: Profilo di %(username)s

source: Edit Profile
it: Edita profilo

source: Current Time
it: Orario corrente

source: Website
it: Sito web

source: %(groupcount)s Group(s), %(agreementcount)s Agreement(s)
it: %(groupcount)s Gruppo(i), %(agreementcount)s Accordo(i)

source: signed
it: firmato

source: member
it: membri

source: Hello %(name)s,
it: Benvenuto %(name)s,

source: To activate your account with username %(username)s, click on the link below:
it: Per attivare il tuo account con nome utente %(username)s, fai clic sul link qui sotto:

source: If you did not create an account for username %(username)s, you can ignore this email.
it: Se non hai creato un account con il nome utente %(username)s, puoi ignorare questa email.

source: The AlmaLinux Team
it: Il team AlmaLinux

source: Hi,
it: Ciao,

source: Click the link below to reset your password. If you did not request a password reset, please ignore this email.
it: Fai clic sul link qui sotto per reimpostare la tua password. Se non hai richiesto il reset della password, ignora questa email.

source: AlmaLinux Account Services
it: Servizi Account AlmaLinux

source: search...
it: Cerca...

source: Settings
it: Impostazioni

source: Help
it: Aiuto

source: Log Out
it: Esci

source: Powered by %(noggin_link)s
it: Supportato da %(noggin_link)s

source: AlmaLinux Accounts
it: Account AlmaLinux

source: AlmaLinux Accounts provides the ability to create and manage your account across AlmaLinux's entire infrastructure.
it: AlmaLinux Accounts consente di creare e gestire il tuo account su tutta l'infrastruttura di AlmaLinux.

source: Additional configuration is required when using Kerberos tickets when OTP is enabled
it: È necessaria una configurazione aggiuntiva quando si utilizzano i ticket Kerberos con OTP abilitato

source: Read the <a href='https://docs.fedoraproject.org/en-US/fedora-accounts/user/#pkinit'>documentation</a> for details on configuring your system
it: Leggi la <a href='https://docs.fedoraproject.org/en-US/fedora-accounts/user/#pkinit'>documentazione</a> per i dettagli sulla configurazione del tuo sistema

source: To validate the email address %(address)s, click on the link below:
it: Per convalidare l'indirizzo email %(address)s, fare clic sul link qui sotto:

source: If you did not set the email address %(address)s in your account %(username)s, you can ignore this email.
it: Se non hai impostato l'indirizzo email %(address)s nel tuo account %(username)s, puoi ignorare questa email.
