Repository: pypi-data/pypi-mirror-392
Catalog: packages/noggin-aaa/noggin_aaa-1.11.0-py3-none-any.whl/noggin/translations/*/LC_MESSAGES/messages.po
Languages: it

source: The Noggin team
it: Il Noggin Team

source: Welcome to noggin!
it: Benvenuto in noggin!

source: This is the open source, community self-service portal for FreeIPA. It allows you to do things like create an account, change your password, manage group membership, and more.
it: Questo è il portale open source e self-service della community per FreeIPA. Ti consente di fare cose come creare un account, cambiare la password, gestire l'appartenenza ai gruppi e altro ancora.

source: You can also use your Fedora account to login here.
it: Puoi anche usare il tuo account Fedora per accedere qui.

source: This link will be valid for %(ttl)s minutes (until %(valid_until)s UTC).
it: Questo link sarà valido per %(ttl)s minuti (fino alle %(valid_until)s UTC).

source: If the link has expired, you can request a new one here:
it: Se il link è scaduto, puoi richiederne uno nuovo qui:

source: Fedora Accounts System
it: Fedora Account System

source: Fedora Accounts allows you to create and manage an account for Fedora Tools and Infrastructure.
it: Fedora Accounts ti consente di creare e gestire un account per gli strumenti e l’infrastruttura di Fedora.

source: Edit Group
it: Modifica Gruppo

source: To change group details or add sponsors, file a ticket with
it: Per modificare i dettagli di un gruppo o aggiungere sponsor, apri un ticket con

source: Create a PDR request to disable your account
it: Crea una richiesta PDR per disabilitare il tuo account

source: Request account deletion
it: Richiedi la cancellazione dell'account

source: Did you lose your last OTP token?
it: Hai perso il tuo ultimo token OTP?

source: If you have lost your last OTP token you need to send an email to %(admin_email)s. Please sign this email using the GPG key associated with your account if possible, so that the administrator can verify your identity.
it: Se hai perso il tuo ultimo token OTP, devi inviare un'email a %(admin_email)s. Se possibile, firma questa email con la chiave GPG associata al tuo account, così l'amministratore potrà verificare la tua identità.

source: If you had multiple tokens and lost one, you can use another to login and delete the lost token from your account.
it: Se avevi più token e ne hai perso uno, puoi usare un altro per accedere ed eliminare il token perso dal tuo account.

source: If you haven't enrolled a OTP token, you don't have one and this doesn't apply to you.
it: Se non hai registrato un token OTP, non ne possiedi uno e questo non ti riguarda.

source: To let admins know that you're not a spammer, please send an email to %(email_link)s and explain the situation.
it: Per far sapere agli amministratori che non sei uno spammer, invia un’email a %(email_link)s e spiega la situazione.

source: By using a Fedora account, you agree to follow the <a href='https://docs.fedoraproject.org/en-US/project/code-of-conduct/'>Fedora&nbsp;Code&nbsp;of&nbsp;Conduct</a>.
it: Utilizzando un account Fedora, accetti di rispettare il <a href='https://docs.fedoraproject.org/en-US/project/code-of-conduct/'>Codice di Condotta di Fedora</a>.

source: You can also use your CentOS account to login here.
it: Puoi anche usare il tuo account CentOS per accedere qui.

source: Group %(groupname)s could not be found.
it: Il gruppo %(groupname)s non è stato trovato.

source: Undo
it: Annulla

source: %(protocol)s on %(server)s
it: %(protocol)s su %(server)s
