Repository: pypi-data/pypi-mirror-392
Catalog: packages/noggin-aaa/noggin_aaa-1.11.0.tar.gz/noggin_aaa-1.11.0/noggin/translations/*/LC_MESSAGES/messages.po
Languages: es

source: Password expired. Please reset it.
es: Contraseña caducada. Restablécela.

source: Could not log in to the IPA server.
es: No pudo acceder al servidor IPA.

source: Welcome, %(username)s!
es: Bienvenido, %(username)s!

source: Token successfully synchronized
es: Vale sincronizado correctamente

source: User %(username)s was not found in the system.
es: El usuario %(username)s no fue encontrado en el sistema.

source: Unable to add user %(username)s: %(errormessage)s
es: No es capaz de añadir usuario %(username)s: %(errormessage)s

source: You got it! %(username)s has been added to %(groupname)s.
es: Correcto. El usuario %(username)s ha sido agregado al grupo %(groupname)s.

source: You got it! %(username)s has been removed from %(groupname)s.
es: Correcto. El usuario %(username)s ha sido retirado del grupo %(groupname)s.

source: You got it! %(username)s is no longer a sponsor of %(groupname)s.
es: Correcto. El usuario %(username)s ya no es más un patrocinador de %(groupname)s.

source: The old password or username is not correct
es: La contraseña anterior o el nombre del usuario no es correcto

source: Could not change password.
es: No se pudo modificar la contraseña.

source: Your password has been changed
es: Su contraseña ha sido cambiada

source: You have already requested a password reset, you need to wait %(wait_min)s minute(s) and %(wait_sec)s seconds before you can request another.
es: Ya ha solicitado un restablecimiento de contraseña, necesita esperar %(wait_min)s minuto(s) y %(wait_sec)s segundos antes que pueda solicitar otra.

source: User %(username)s does not exist
es: El usuario %(username)s no existe

source: We could not send you an email, please retry later
es: No pudimos enviarle un correo-e, reinténtelo más tarde

source: Your email address is rejected by smtp server
es: Su dirección de correo-e ha sido rechazada por el servidor smtp

source: An email has been sent to your address with instructions on how to reset your password
es: Ha sido enviado un correo-e a su dirección con instrucciones acerca de como restablecer su contraseña

source: The token is invalid, please request a new one.
es: El vale no es válido. Debe solicitar uno nuevo.

source: The token has expired, please request a new one.
es: El vale ha caducado, solicite uno nuevo.

source: Your password has been changed since you requested this token, please request a new one.
es: Su contraseña ha sido modificada desde que solicitó este vale, por favor, solicite uno nuevo.

source: Your password has been changed, but it does not comply with the policy (%(policy_error)s) and has thus been set as expired. You will be asked to change it after logging in.
es: Su contraseña ha sido modificada, pero no cumple con la normativa (%(policy_error)s) y, por tanto, ha sido caducada. Se le solicitará cambiarla tras su acceso.

source: Incorrect value.
es: Valor incorrecto.

source: Could not change password, please try again.
es: No se pudo cambiar la contraseña. Inténtelo de nuevo.

source: Your password has been changed.
es: Su contraseña ha sido modificada.

source: Verify your email address
es: Verifique su dirección de correo-e

source: We could not send you the address validation email, please retry later
es: No pudimos enviarle la dirección de validación del correo-e, inténtelo más tarde

source: The username '%(username)s' or the email address '%(email)s' are already taken.
es: El nombre de usuario '%(username)s' o la dirección de correo-e %(email)s ya está introducida.

source: An error occurred while creating the account, please try again.
es: Ha sucedido un error mientras creaba la cuenta; inténtelo de nuevo.

source: The registration seems to have failed, please try again.
es: El registro parece haber fallado; inténtelo de nuevo.

source: The address validation email has be sent again. Make sure it did not land in your spam folder
es: La validación de la dirección del correo-e ha sido enviado de nuevo. Asegúrese que no acabe en su carpeta de spam

source: No token provided, please check your email validation link.
es: Ningún vale proporcionado, compruebe su enlace de validez del correo-e.

source: The token is invalid, please register again.
es: El vale no es válido; regístrese otra vez.

source: This token is no longer valid, please register again.
es: Este vale no es válido más; regístrese de nuevo.

source: This user cannot be found, please register again.
es: Este usuario no puede ser encontrado; regístrelo de nuevo.

source: The username and the email address don't match the token you used, please register again.
es: No coincide el nombre de usuario y la dirección de correo-e con el vale utilizado; regístrese de nuevo.

source: Something went wrong while creating your account, please try again later.
es: Algo fue mal mientras creaba su cuenta; inténtelo más tarde.

source: Your account has been created, but the password you chose does not comply with the policy (%(policy_error)s) and has thus been set as expired. You will be asked to change it after logging in.
es: Su cuenta ha sido creada, pero la contraseña escogida no cumple con la normativa (%(policy_error)s) y por tanto ha sido fijado como caducado. Se le solicitará que lo cambie tras acceder.

source: Your account has been created, but an error occurred while setting your password (%(message)s). You may need to change it after logging in.
es: Su cuenta ha sido creada, pero ha sucedido un error mientras configuraba su contraseña (%(message)s). Puede necesitar cambiarlo tras acceder.

source: Congratulations, your account has been created! Welcome, %(name)s.
es: ¡Felicitaciones!, su cuenta ha sido creada. Bienvenido, %(name)s.

source: Congratulations, your account has been created! Go ahead and sign in to proceed.
es: ¡Enhorabuena!, su cuenta ha sido creada. Continúe y entre en el sistema.

source: All
es: Todos

source: Unknown
es: Desconocido

source: Not Spam
es: No Spam

source: Awaiting
es: En espera

source: Registration is closed at the moment.
es: La inscripción está cerrada en el momento.

source: The email address %(mail)s needs to be validated. Please check your inbox and click on the link to proceed. If you can't find the email in a couple minutes, check your spam folder.
es: La dirección de correo-e %(mail)s necesita ser validado. Compruebe su bandeja de entrada y pulse en el enlace para continuar. Si no puede encontrar el correo-e en un par de minutos, examine vuestra carpeta de spam.

source: No modifications.
es: Sin modificaciones.

source: The token is invalid, please set the email again.
es: El vale no es válido, fije el correo-e de nuevo.

source: This token is no longer valid, please set the email again.
es: Este vale no es válido más, establezca el correo-e otra vez.

source: This token does not belong to you.
es: Este vale no te pertenece.

source: Incorrect password
es: Contraseña incorrecta

source: Cannot create the token.
es: No se puede crear el vale.

source: The token has been created.
es: El vale ha sido creado.

source: Cannot rename the token.
es: No se puede renombrar el vale.

source: Sorry, You cannot disable your last active token.
es: Disculpe, no se puede desactivar su último vale activo.

source: Cannot disable the token.
es: No se puede desactivar el vale.

source: Cannot enable the token. %(errormessage)s
es: No se puede habilitar el vale. %(errormessage)s

source: Sorry, You cannot delete your last active token.
es: Disculpe, no se puede borrar su último vale activo.

source: Cannot delete the token.
es: No se puede borrar el vale.

source: Unknown agreement: %(name)s.
es: Acuerdo desconocido: %(name)s.

source: Cannot sign the agreement "%(name)s": %(error)s
es: No se puede firmar el acuerdo «%(name)s»: %(error)s

source: You signed the "%(name)s" agreement.
es: Ha firmado el acuerdo de «%(name)s».

source: This does not look like a valid nickname.
es: Esto no parece un apodo válido.

source: This does not look like a valid server name.
es: Esto no parece un nombre de servidor válido.

source: First Name
es: Nombre

source: First name must not be empty
es: El nombre no puede estar vacío

source: Last Name
es: Apellido

source: Last name must not be empty
es: El apellido no debe estar vacío

source: Locale
es: Lugar

source: Locale must not be empty
es: El lugar no debe estar vacío

source: Locale must be a valid locale short-code
es: El lugar debe ser un código breve válido del lugar

source: Chat Nicknames
es: Apodos de chat

source: Timezone
es: Zona horaria

source: Timezone must not be empty
es: La zona horaria debe no estar vacía

source: Timezone must be a valid timezone
es: La zona horaria debe ser un timezone válido

source: GitHub Username
es: Usuario de GitHub

source: GitLab Username
es: Usuario de GitLab

source: Website or Blog URL
es: URL de sitio web o blog

source: Valid URL required
es: Se requiere URL válida

source: Private
es: Privado

source: Hide information from other users, see the Privacy Policy for details.
es: Oculta información desde otros usuarios, consulte la Normativa Privativa para detalles.

source: Pronouns
es: Pronombres

source: E-mail Address
es: Direc. de correo-e

source: Email must not be empty
es: El correo-e no debe estar vacío

source: Email must be valid
es: El correo-e debe ser válido

source: Red Hat Bugzilla Email
es: Correo del Bugzilla Red Hat

source: SSH Keys
es: Claves SSH

source: GPG Keys
es: Claves GPG

source: Token name
es: Nombre de vale

source: Add an optional name to help you identify this token
es: Añada un nombre opcional para ayudar a identificarle este vale

source: Enter your current password
es: Introduzca su contraseña actual

source: You must provide a password
es: Debe proporcionar una contraseña

source: please reauthenticate so we know it is you
es: reautentique tal que sepamos que eres tú

source: One-Time Password
es: Contraseña de un solo uso

source: Enter your One-Time Password
es: Introduzca su Contraseña de Un Solo Uso

source: Generate OTP Token
es: Genera Vale de OTP

source: Could not find the token secret
es: No pudo encontrar el vale secreto

source: Verification Code
es: Código de verificación

source: You must provide a verification code
es: Debe proporcionar un código de verificación

source: Verify and Enable OTP Token
es: Verificar y Habilitar Vale OTP

source: The code is wrong, please try again.
es: El código es incorrecto, inténtelo de nuevo.

source: Token must not be empty
es: El vale no debe estar vacío

source: Agreement must not be empty
es: El acuerdo debe no estar vacío

source: New member username must not be empty
es: El miembro de usuario nuevo no debe estar vacío

source: Username
es: Usuario

source: Username must not be empty
es: El usuario debe no estar vacío

source: You must provide a user name
es: Debe proporcionar un nombre de usuario

source: Password
es: Contraseña

source: Log In
es: Iniciar sesión

source: New Password
es: Contraseña Nueva

source: Password must not be empty
es: La contraseña debe no estar vacía

source: Passwords must match
es: Las contraseñas deben coincidir

source: Confirm New Password
es: Confirmar Contraseña Nueva

source: One-Time Password (if your account has Two-Factor Authentication enabled)
es: Contraseña de Una-Vez (si su cuenta tiene activada la Autenticación de Dos-Factores)

source: Current Password
es: Contraseña Actual

source: Current password must not be empty
es: La contraseña actual no debe estar vacía

source: User name must not be empty
es: Nombre de usuario debe no estar vacío

source: Enter your username to reset your password
es: Introduzca su Usuario para restablecer su contraseña

source: Only these characters are allowed: "%(chars)s".
es: Solo están permitidos estos caracteres: «%(chars)s».

source: I am over 16 years old
es: Tengo más de 16 años

source: You must be over 16 years old to create an account
es: Debe tener una edad de más de 16 años para crear una cuenta

source: Register
es: Registrar

source: Resend email
es: Reenviar correo-e

source: Please choose a strong password
es: Elija una contraseña fuerte

source: Confirm Password
es: Confirmar Contraseña

source: Activate
es: Activar

source: First OTP
es: OTP Primero

source: You must provide a first code
es: Debe proporcionar un primer código

source: Second OTP
es: OTP Segundo

source: You must provide a second code
es: Debe proporcionar un segundo código

source: Token ID
es: ID de Vale

source: Email addresses from that domain are not allowed
es: Direcciones de correo-e desde ese dominio no están permitidos

source: Mixed case is not allowed, try lower case.
es: Mezcla de MAYÚS/minús no está permitido, intente solo minúsculas.

source: Field must not match "%(pattern)s".
es: El campo no coincide con «%(pattern)s».

source: That page wasn't found.
es: Esa página no fue encontrada.

source: Forgot Password?
es: ¿Olvidó la contraseña?

source: Forgot Password or OTP?
es: ¿Olvidó la contraseña o el OTP?

source: Sync Token
es: Sinc Vale

source: Previous
es: Anterior

source: current
es: actual

source: Next
es: Siguiente

source: Groups
es: Grupos

source: Users
es: Usuarios

source: Password Recovery
es: Recuperar Contraseña

source: Did you forget your password?
es: ¿Olvidaste su contraseña?

source: Enter your username and an email will be sent to your address with further instructions.
es: Introduzca su usuario y un correo será enviado a su dirección con más instrucciones.

source: Send
es: Enviar

source: Reset Password
es: Restablecer Contraseña

source: Password Reset for %(username)s
es: Restablecer Contraseña para %(username)s

source: %(groupname)s Group
es: Grupo %(groupname)s

source: You are a sponsor of this group, but not a member. Add yourself if you want to be a member.
es: Eres un patrocinador de este grupo, pero no un miembro. Añádase usted mismo si desea ser un miembro.

source: To join this group, contact a group sponsor.
es: Para unirse a este grupo, contacte con un patrocinador del grupo.

source: Sponsors
es: Patrocinadores

source: no sponsors
es: sin patrocinadores

source: Members
es: Miembros

source: add user...
es: añadir usuario…

source: Leave group
es: Abandonar grupo

source: No members yet.
es: Aún sin miembros.

source: Group List
es: Lista de grupo

source: %(member_count)s members
es: %(member_count)s miembros

source: No groups.
es: Ningún grupo.

source: Login
es: Iniciar sesión

source: IPA Error
es: Error IPA

source: There was a problem with the IPA backend, please try again later.
es: Hubo un problema con el backend IPA, intente otra vez más tarde.

source: You can also <a href="%(url)s">log out</a> and log back in if the problem persists.
es: Además puede <a href="%(url)s">salir</a> y volver a entrar si el problema persiste.

source: Expired Password Reset
es: Restablecer Contraseña Caducada

source: Expired Password Reset for %(username)s
es: Restablecer Contraseña Caducada para %(username)s

source: Change Password
es: Cambiar Contraseña

source: Registering Users
es: Registrando Usuarios

source: Name:
es: Nombre:

source: Email:
es: Correo-e:

source: Registered:
es: Registrado:

source: Status:
es: Estado:

source: Waiting for spam check
es: Esperando comprobante de spam

source: Not flagged as spam
es: No indicado como spam

source: Flagged as spam
es: Indicado como spam

source: Spam status unknown
es: Estado de spam desconocido

source: Accept
es: Aceptar

source: Flag as spam
es: Indicar como spam

source: Delete
es: Eliminar

source: Clicking on Accept will send the validation email to this user. Other buttons will not send anything.
es: Pulse en Aceptar enviará el correo de validación a este usuario. Los otros botones no enviarán nada.

source: No registering users in this state at the moment.
es: En este estado en este momento no registra usuarios.

source: No registering users at the moment.
es: En este momento no registra usuarios.

source: Activate your account
es: Active su cuenta

source: Account creation, step 3/3
es: Creación de cuenta, paso 3/3

source: Hello %(name)s. To activate your account, please choose a password.
es: Hola %(name)s. Para activar su cuenta, elija una contraseña.

source: Validate your email address
es: Valida su dirección de correo-e

source: Account creation, step 2/3
es: Creación de cuenta, paso 2/3

source: Congratulations %(name)s, your account has been created!
es: ¡Enhorabuena %(name)s, su cuenta ha sido creada!

source: Before you can log in, your email address: %(mail)s needs to be validated. Please check your inbox and click on the link to proceed.
es: Antes que pueda acceder, su dirección de correo: %(mail)s necesita ser validada. Compruebe su bandeja y pulse en el enlace para comenzar.

source: If you can't find the email in a couple minutes, check your spam folder. If it's not there, you can ask for another validation email by clicking on the button below.
es: Si no puede encontrar el correo-e en un par de minutos, compruebe su carpeta spam. Si no está allí, puedes pedir otra validación de correo-e pulsando en el botón de abajo.

source: Spam check in progress
es: Comprobante de spam en progreso

source: Your account is being checked
es: Su cuenta está siendo comprobada

source: Before you can log in, your account needs to be check for spam likelihood. It should only take a few seconds, please wait...
es: Antes que pueda acceder, su cuenta necesita ser comprobada para la probabilidad de spam. Solamente tendría que tomar unos pocos segundos, espera…

source: Your account requires admin approval
es: Su cuenta requiere aprobación administrativa

source: Your account needs to be approved by an administrator.
es: Su cuenta necesita ser aprobada por un administrador.

source: You will receive an email when the decision has been taken.
es: Recibirá un correo-e cuando la decisión haya sido tomada.

source: Thank you for your patience.
es: Gracias por su paciencia.

source: Your account is blocked
es: Su cuenta está bloqueada

source: Your account has been flagged as spam.
es: Su cuenta ha sido marcada como spam.

source: Something went wrong
es: Algo fue incorrecto

source: Unsupported spam status: %s, please contact the administrators
es: Estado de spam no mantenido: %s, contacte con los administradores

source: Sync OTP Token
es: Sinc. vale OTP

source: Synchronize OTP Token
es: Sincroniza Vale OTP

source: Sync
es: Sinc

source: View agreement
es: Vista de acuerdo

source: Sign
es: Firma

source: Sign User Agreement
es: Firma de Acuerdo del Usuario

source: Validate your email
es: Validar su correo-e

source: Hello %(user_name)s. Do you want to set your %(attr_name)s to %(mail)s?
es: Hola %(user_name)s. ¿Quieres poner vuestro %(attr_name)s a %(mail)s?

source: Cancel
es: Cancelar

source: Do it
es: Hazlo

source: Save
es: Guardar

source: GPG Key ID
es: ID Clave GPG

source: SSH Public Key
es: Clave SSL Pública

source: Scan your new token
es: Analiza su vale nuevo

source: Your new token is ready. Click on the button below to reveal the QR code and scan it.
es: Su vale nuevo está listo. Pulse en el botón de abajo para revelar el código QR y analícelo.

source: Reveal
es: Revelar

source: or copy and paste the following token URL if you can't scan the QR code:
es: o copiar y pegar la URL del vale siguiente si no puede analizar el código QR:

source: Add OTP Token
es: Añadir vale OTP

source: Creating your first OTP token enables two-factor authentication using OTP.
es: Crea su primer vale OTP habilita autenticación de dos factores utilizando OTP.

source: Once enabled, two-factor authentication cannot be disabled.
es: Una vez habilitado, la autenticación de dos factores no puede ser deshabilitada.

source: OTP Tokens
es: Vales OTP

source: (no name)
es: (sin nombre)

source: Rename
es: Renombrar

source: Disable
es: Desactivar

source: Enable
es: Activar

source: You have no OTP tokens
es: No tienes ningún vale OTP

source: Add an OTP token to enable two-factor authentication on your account.
es: Añada un vale OTP para habilitar autenticación de dos factores en su cuenta.

source: Change Avatar
es: Cambiar Avatar

source: The format is either <code>username</code> or <code>username:server.name</code> if you're not using the default servers:
es: El formato es tampoco <code>username</code> o <code>username:server.name</code> si no estás utilizando el default servidores:

source: For %(title)s: <code>%(server)s</code>
es: Para %(title)s: <code>%(server)s</code>

source: Settings for %(username)s
es: Configurar para %(username)s

source: Profile
es: Perfil

source: Emails
es: Correos-e

source: SSH &amp; GPG Keys
es: Claves SSH y GPG

source: Agreements
es: Acuerdos

source: Profile for %(username)s
es: Perfil para %(username)s

source: Edit Profile
es: Editar Perfil

source: Current Time
es: Hora Actual

source: Chat
es: Charla

source: Website
es: Sitio web

source: %(groupcount)s Group(s), %(agreementcount)s Agreement(s)
es: %(groupcount)s Grupo(s), %(agreementcount)s Acuerdo(s)

source: signed
es: firmado

source: sponsor
es: patrocinador

source: member
es: miembro

source: Hello %(name)s,
es: Hola %(name)s,

source: To activate your account with username %(username)s, click on the link below:
es: Para activar su cuenta con usuario %(username)s, pulse en el enlace a continuación:

source: If you did not create an account for username %(username)s, you can ignore this email.
es: Si no creó una cuenta para el usuario %(username)s, puede ignorar este correo-e.

source: The AlmaLinux Team
es: El Equipo AlmaLinux

source: Hi,
es: Hola,

source: Click the link below to reset your password. If you did not request a password reset, please ignore this email.
es: Pulse el enlace de abajo para restablecer su contraseña. Si no solicitó un restablecimiento de cuenta, ignore este correo-e.

source: AlmaLinux Account Services
es: Servicios de Cuenta AlmaLinux

source: search...
es: buscar…

source: Settings
es: Configuración

source: Help
es: Ayuda

source: Log Out
es: Salir

source: Powered by %(noggin_link)s
es: Manufacturado por %(noggin_link)s

source: AlmaLinux Accounts
es: Cuentas AlmaLinux

source: AlmaLinux Accounts provides the ability to create and manage your account across AlmaLinux's entire infrastructure.
es: Cuentas AlmaLinux proporcionan la habilidad de crear y gestionar su cuenta a través de la completa infraestructura de AlmaLinux.

source: Additional configuration is required when using Kerberos tickets when OTP is enabled
es: Se requiere configuración adicional cuando utilice tickets de Kerberos cuando OTP esté activado

source: Read the <a href='https://docs.fedoraproject.org/en-US/fedora-accounts/user/#pkinit'>documentation</a> for details on configuring your system
es: Lea la <a href='https://docs.fedoraproject.org/es/fedora-accounts/user/#pkinit'>documentación</a> para detalles con la configuración de su sistema

source: To validate the email address %(address)s, click on the link below:
es: Para validar la dirección de correo-e %(address)s, pulse sobre el enlace de abajo:
